Моя/src/Documents/Счет/Счет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Счет</name>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагОплатаПоКурсу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>флагВыводитьПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭквивалент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьВДодохе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Моя/src/Documents/Счет/Forms/ФормаИмпортаДанных/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	МассивДанных = ПолучитьДанныеНаСервере();
	Закрыть(МассивДанных);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеНаСервере()

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Наименование");
	ТаблицаЗначений.Колонки.Добавить("Часов",Новый ОписаниеТипов("Число")); 
	ТаблицаЗначений.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));


	ВысотаТаблицы = ДанныеИмпорта.ВысотаТаблицы;
	Для Сч = 2 По ВысотаТаблицы Цикл
		Наименование	= ДанныеИмпорта.Область("R" + Сч + "C1").Текст;
		Часов			= ДанныеИмпорта.Область("R" + Сч + "C3").Текст;
		Цена			= ДанныеИмпорта.Область("R" + Сч + "C4").Текст;
		Сумма			= ДанныеИмпорта.Область("R" + Сч + "C5").Текст;

		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Наименование	= Наименование;
		НоваяСтрока.Часов			= СтрокаВЧисло(Часов);
		НоваяСтрока.Цена			= СтрокаВЧисло(Цена);
		НоваяСтрока.Сумма			= СтрокаВЧисло(Сумма);

	КонецЦикла;
	МассивСтруктур = ПреобразоватьТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений);
	Возврат МассивСтруктур;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаВЧисло(ЧислоКакСтрока) 
	Если СокрЛП(ЧислоКакСтрока) = "" Тогда
		Возврат 0;
	КонецЕсли;	
	ЧислоКакЧисло = СтрЗаменить(ЧислоКакСтрока,Символы.НПП,"");
	ЧислоКакЧисло = СтрЗаменить(ЧислоКакЧисло," ","");

	Возврат Число(ЧислоКакЧисло);
КонецФункции 

&НаСервере
Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений)

	Массив = Новый Массив();

	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;

	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл

		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;

		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;

	КонецЦикла;

	Для Каждого Строка Из ТаблицаЗначений Цикл

		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

		Массив.Добавить(НоваяСтрока);

	КонецЦикла;

	Возврат Массив;

КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныйДокумент()
	
	Макет = Документы.Счет.ПолучитьМакет("ШаблонИмпорт");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ДанныеИмпорта.Вывести(ОблШапка);
	
КонецПроцедуры

#КонецОбласти
